snlkuharlocal/src/Documents/РасходыСкладаПоНакладным/РасходыСкладаПоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходыСкладаПоНакладным</name>
  <attributes>
    <name>СуммаДокументаОбщая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокументаОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПланОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяФактОбщее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоПоРасходникамНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоПоРасходникамНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсегоПоВремениНаДОНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоРасходникамНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоРасходникамНакладной</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПланДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяФактДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасходныеМатериалыПоНоменклатуре</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныйМатериал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеМатериалыПоНакладной</name>
    <attributes>
      <name>РасходныйМатериал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяПоНоменклатуре</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗатраченноеВремяПоНакладной</name>
    <attributes>
      <name>ВидРаботы</name>
      <type>
        <types>CatalogRef.ВидыВыполняемыхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/РасходыСкладаПоНакладным/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс=ПараметрыСеанса.ЭтотУзел.Код+"-";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если не МожноЗаписывать() тогда 
		отказ=Истина;
	иначе
		ЗаполнитьШапкуРСП();
	КонецЕсли;
	
	
КонецПроцедуры



Процедура ЗаполнитьШапкуРСП ()
	
	ВсегоПоРасходникамНакладной=РасходныеМатериалыПоНакладной.Итог("Всего");
	ВсегоПоРасходникамНоменклатуры=РасходныеМатериалыПоНоменклатуре.Итог("Всего");
	ВсегоПоВремениНаДОНоменклатуры=ЗатраченноеВремяПоНоменклатуре.Итог("Всего");
	СуммаДокументаОбщая=ВсегоПоРасходникамНакладной+ВсегоПоРасходникамНоменклатуры+ВсегоПоВремениНаДОНоменклатуры;
	
	КоличествоПоРасходникамНоменклатуры=РасходныеМатериалыПоНоменклатуре.Итог("Количество");	
	КоличествоПоРасходникамНакладной=РасходныеМатериалыПоНакладной.Итог("Количество");	
	КоличествоДокументаОбщее=КоличествоПоРасходникамНоменклатуры+ КоличествоПоРасходникамНакладной;
	
	ВремяПланОбщее=ЗатраченноеВремяПоНакладной.Итог("ВремяПлан");
	ВремяФактОбщее=ЗатраченноеВремяПоНакладной.Итог("ВремяФакт");
	
	ВремяПланДО=0;	
	ВремяФактДО=0;	
	
	МассСтрок=ЗатраченноеВремяПоНакладной.НайтиСтроки(Новый Структура("ВидРаботы",Справочники.ВидыВыполняемыхРабот.ДопОбработка));
	Для каждого СтрМасс из МассСтрок цикл
		ВремяПланДО=ВремяПланДО+СтрМасс.ВремяПлан;	
		ВремяФактДО=ВремяФактДО+СтрМасс.ВремяФакт;			
	КонецЦикла;
	
	Дата=ДокОснование.ДатаОтгрузки;
КонецПроцедуры

Функция МожноЗаписывать ()
	МожноЗаписывать=Истина;
	
	
	если не ЗначениеЗаполнено(ДокОснование) тогда
		СообщитьИзМодуля("Не заполнен документ основания.");
		МожноЗаписывать=Ложь;
	иначе
		если не ЗначениеЗаполнено(ДокОснование.ДатаОтгрузки) тогда
			СообщитьИзМодуля("Не заполнена дата отгрузки накладной "+ДокОснование);
			МожноЗаписывать=Ложь;
		КонецЕсли;	
	КонецЕсли;
	возврат МожноЗаписывать;
	
КонецФункции
